RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_pmu.h
/*!
    \file    gd32h77x_78x_pmu.h
    \brief   definitions for the PMU

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_78X_PMU_H
#define GD32H77X_78X_PMU_H

#include "gd32h77x_78x.h"

/* PMU definitions */
#define PMU                             PMU_BASE                            /*!< PMU base address */

/* registers definitions */
#define PMU_CTL0                        REG32((PMU) + 0x00000000U)          /*!< PMU control register 0 */
#define PMU_CS                          REG32((PMU) + 0x00000004U)          /*!< PMU control and status register */
#define PMU_CTL1                        REG32((PMU) + 0x00000008U)          /*!< PMU control register 1 */
#define PMU_CTL2                        REG32((PMU) + 0x0000000CU)          /*!< PMU control register 2 */
#define PMU_CTL3                        REG32((PMU) + 0x00000010U)          /*!< PMU control register 3 */
#define PMU_PAR                         REG32((PMU) + 0x00000018U)          /*!< PMU parameter register */

/* bits definitions */
/* PMU_CTL0 */
#define PMU_CTL0_COREPOROFFOUT          BIT(0)                              /*!< CORE POR OFF output */
#define PMU_CTL0_STBMOD                 BIT(1)                              /*!< standby mode */
#define PMU_CTL0_WURST                  BIT(2)                              /*!< wakeup flag reset */
#define PMU_CTL0_STBRST                 BIT(3)                              /*!< standby flag reset */
#define PMU_CTL0_LVDEN                  BIT(4)                              /*!< low voltage detector enable */
#define PMU_CTL0_LVDT                   BITS(5,7)                           /*!< low voltage detector threshold */
#define PMU_CTL0_BKPWEN                 BIT(8)                              /*!< backup domain write enable */
#define PMU_CTL0_COREPOROFFP            BIT(9)                              /*!< CORE POR OFF output polarity selection */
#define PMU_CTL0_COREPDREN              BIT(10)                             /*!< CORE PDR circuit enable signal */
#define PMU_CTL0_SLDOVS                 BITS(14,15)                         /*!< Deepsleep mode LDO output voltage select */
#define PMU_CTL0_VAVDEN                 BIT(16)                             /*!< VDDA analog voltage detector enable */
#define PMU_CTL0_VAVDVC                 BITS(17,18)                         /*!< VDDA analog voltage detector level configure bits */
#define PMU_CTL0_VOVDEN                 BIT(19)                             /*!< Vcore voltage detector enable */
#define PMU_CTL0_VUVDEN                 BIT(24)                             /*!< Vcore under voltage detector enable */
#define PMU_CTL0_VOVDVC                 BITS(25,26)                         /*!< Vcore over voltage detector voltage level configure bits */
#define PMU_CTL0_VUVDVC                 BITS(27,28)                         /*!< Vcore under voltage detector voltage level configure bits */
#define PMU_CTL0_SRAM_MODE              BITS(29,30)                         /*!< Sram_mode in Deep-sleep */
#define PMU_CTL0_SRAM_PRDYN             BIT(31)                             /*!< Indicates if the device has entered Deep-sleep mode */

/* PMU_CS */
#define PMU_CS_WUF                      BIT(0)                              /*!< wakeup flag */
#define PMU_CS_STBF                     BIT(1)                              /*!< standby flag */
#define PMU_CS_LVDF                     BIT(2)                              /*!< low voltage detector status flag */
#define PMU_CS_UVDF                     BIT(3)                              /*!< Record the undervoltage reset of the Vcore */
#define PMU_CS_VUVDF0                   BIT(5)                              /*!< Vcore under voltage detector flag bit */
#define PMU_CS_VOVDF1                   BIT(6)                              /*!< Vcore over voltage detector flag bit after digital filter */
#define PMU_CS_VUVDF1                   BIT(7)                              /*!< Vcore under voltage detector flag bit after digital filter */
#define PMU_CS_WUPEN0                   BIT(8)                              /*!< wakeup pin0(PA0) enable */
#define PMU_CS_WUPEN1                   BIT(9)                              /*!< wakeup pin1(PA2) enable */
#define PMU_CS_WUPEN3                   BIT(11)                             /*!< wakeup pin3(PC13) enable */
#define PMU_CS_WUPEN5                   BIT(13)                             /*!< wakeup pin5(PC1) enable */
#define PMU_CS_VAVDF                    BIT(16)                             /*!< VDDA analog voltage detector voltage output on VDDA flag */
#define PMU_CS_VOVDF                    BIT(20)                             /*!< Vcore voltage detector flag */

/* PMU_CTL1 */
#define PMU_CTL1_BKPVSEN                BIT(0)                              /*!< Backup regulator enable */
#define PMU_CTL1_VBTMEN                 BIT(4)                              /*!< VBAT and temperature monitoring enable */
#define PMU_CTL1_BKPVSRF                BIT(16)                             /*!< Backup regulator ready */
#define PMU_CTL1_VBATLF                 BIT(20)                             /*!< VBAT level monitoring versus low threshold */
#define PMU_CTL1_VBATHF                 BIT(21)                             /*!< VBAT level monitoring versus high threshold */
#define PMU_CTL1_TEMPLF                 BIT(22)                             /*!< temperature level monitoring versus low threshold */
#define PMU_CTL1_TEMPHF                 BIT(23)                             /*!< temperature level monitoring versus high threshold */

/* PMU_CTL2 */
#define PMU_CTL2_VOVDO_DNF              BITS(0,7)                           /*!< VUVD analog output digital noise filter */
#define PMU_CTL2_VUVDO_DNF              BITS(8,15)                          /*!< VOVD analog output digital noise filter */

/* PMU_CTL3 */
#define PMU_CTL3_BYPASS                 BIT(0)                              /*!< power management unit bypass control bit */
#define PMU_CTL3_DVSEN                  BIT(2)                              /*!< SMPS step-down converter enable SDEN */
#define PMU_CTL3_MIPI_RDY_FALL          BIT(6)                              /*!< record the occurrence of undervoltage reset on VDD09DSI */
#define PMU_CTL3_VCEN                   BIT(8)                              /*!< VBAT battery charging resistor selection */
#define PMU_CTL3_VCRSEL                 BIT(9)                              /*!< VBAT battery charging enable */
#define PMU_CTL3_MIPI_PDR_LEV           BIT(10)                             /*!< MIPI_LDO VDD09DSI PDR threshold selection control signal */
#define PMU_CTL3_MIPI_PDR_EN            BIT(11)                             /*!< MIPI_LDO VDD09DSI PDR function enable signal */
#define PMU_CTL3_MIPISW                 BIT(17)                             /*!< Powers off the MIPI */
#define PMU_CTL3_PKCAUSW                BIT(18)                             /*!< Powers off the PKCAU */
#define PMU_CTL3_ESCSW                  BIT(19)                             /*!< Powers off the ETHC */
#define PMU_CTL3_MIPIHTF                BIT(20)                             /*!< Mipi power switch ack flag */
#define PMU_CTL3_MIPIHTEN               BIT(21)                             /*!< MIPI output isolation enable */
#define PMU_CTL3_PKCAUHTEN              BIT(22)                             /*!< PKCAU output isolation enable */
#define PMU_CTL3_ESCHTEN                BIT(23)                             /*!< ESC output isolation enable */
#define PMU_CTL3_VUSB33DEN              BIT(24)                             /*!< VDD33USB voltage level detector enable bit */
#define PMU_CTL3_USBSEN                 BIT(25)                             /*!< USB regulator enable */
#define PMU_CTL3_USB33RF                BIT(26)                             /*!< USB supply ready flag */
#define PMU_CTL3_MIPI_LDO_EN            BIT(27)                             /*!< MIPI_LDO enable signal */
#define PMU_CTL3_MIPI_LDO_BYP           BIT(28)                             /*!< MIPI_LDO BYPASS mode enable signal */
#define PMU_CTL3_MIPI_LDO_RDY           BIT(29)                             /*!< The MIPI_LDO output voltage ready signal */
#define PMU_CTL3_PKCAUHTF               BIT(30)                             /*!< PKCAU power switch ack flag */
#define PMU_CTL3_ESCHTF                 BIT(31)                             /*!< ESC power switch ack flag */

/* PMU_PAR */
#define PMU_PAR_PWR_CNT                 BITS(0,11)                          /*!< exit Deep-sleep mode wait time count configure bits */
#define PMU_PAR_TSW_IRCCNT              BITS(16,20)                         /*!< when enter Deep-sleep, switch to LPIRC4M / IRC64M (confirmed by DSPWUSSEL) clock. */

/* constants definitions */
/* PMU low voltage detector threshold definitions */
#define CTL0_LVDT(regval)               ((BITS(5,7) & ((uint32_t)(regval) << 5U)))
#define PMU_LVDT_0                      CTL0_LVDT(0)                        /*!< voltage threshold is 2.1V */
#define PMU_LVDT_1                      CTL0_LVDT(1)                        /*!< voltage threshold is 2.3V */
#define PMU_LVDT_2                      CTL0_LVDT(2)                        /*!< voltage threshold is 2.4V */
#define PMU_LVDT_3                      CTL0_LVDT(3)                        /*!< voltage threshold is 2.6V */
#define PMU_LVDT_4                      CTL0_LVDT(4)                        /*!< voltage threshold is 2.7V */
#define PMU_LVDT_5                      CTL0_LVDT(5)                        /*!< voltage threshold is 2.9V */
#define PMU_LVDT_6                      CTL0_LVDT(6)                        /*!< voltage threshold is 3.0V */
#define PMU_LVDT_7                      CTL0_LVDT(7)                        /*!< Input analog voltage on PB7 (compared with 0.8V) */

/* PMU Deepsleep mode LDO output voltage select definitions */
#define CTL0_SLDOVS(regval)             (BITS(14,15) & ((uint32_t)(regval) << 14U))
#define PMU_SLDOVS_1                    CTL0_SLDOVS(1)                      /*!< Deep-sleep mode LDO voltage 0.7V */
#define PMU_SLDOVS_2                    CTL0_SLDOVS(2)                      /*!< Deep-sleep mode LDO voltage 0.8V (default)*/
#define PMU_SLDOVS_3                    CTL0_SLDOVS(3)                      /*!< Deep-sleep mode LDO voltage 0.9V */

