RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_pmu.h
/* PMU wakeup pin definitions */
#define PMU_WAKEUP_PIN0                 PMU_CS_WUPEN0                       /*!< wakeup pin 0 */
#define PMU_WAKEUP_PIN1                 PMU_CS_WUPEN1                       /*!< wakeup pin 1 */
#define PMU_WAKEUP_PIN3                 PMU_CS_WUPEN3                       /*!< wakeup pin 3 */
#define PMU_WAKEUP_PIN5                 PMU_CS_WUPEN5                       /*!< wakeup pin 5 */

/* PMU SMPS LDO supply mode definitions */
#define PMU_DIRECT_SMPS_SUPPLY          PMU_CTL3_DVSEN                      /*!< Core domains are suppplied from the SMPS only */
#define PMU_BYPASS                      PMU_CTL3_BYPASS                     /*!< The SMPS disabled and the LDO Bypass. The Core domains are supplied from an external source */

/* PMU command constants definitions */
#define WFI_CMD                         ((uint8_t)0x00U)                    /*!< use WFI command */
#define WFE_CMD                         ((uint8_t)0x01U)                    /*!< use WFE command */

/* PMU PDR FALLING THRESHOLD0 definitions*/
#define PDR_FALLING_THRESHOLD0          ((uint8_t)0x00U)                    /*!< PDR falling threshold is 0.775V, POR rising threshold is 0.8V */
#define PDR_FALLING_THRESHOLD1          ((uint8_t)0x01U)                    /*!< PDR falling threshold is 0.675V, POR rising threshold is 0.7V */

#ifdef FW_DEBUG_ERR_REPORT
/* check enter Deep-sleep mode wait time */
#define NOT_PMU_ENTER_WAITTIME(wait_time)                (((uint32_t)(wait_time)) > 0x1FU)
/* check exit Deep-sleep mode wait time */
#define NOT_PMU_EXIT_WAITTIME(wait_time)                 (((uint32_t)(wait_time)) > 0xFFFU)
/* check PMU low voltage detector threshold */
#define NOT_PMU_LVD(lvdt_n)                              (((lvdt_n) != PMU_LVDT_0) && ((lvdt_n) != PMU_LVDT_1) && \
                                                          ((lvdt_n) != PMU_LVDT_2) && ((lvdt_n) != PMU_LVDT_3) && \
                                                          ((lvdt_n) != PMU_LVDT_4) && ((lvdt_n) != PMU_LVDT_5) && \
                                                          ((lvdt_n) != PMU_LVDT_6) && ((lvdt_n) != PMU_LVDT_7))
/* check PMU analog voltage detector threshold */
#define NOT_PMU_AVD(avd_n)                               (((avd_n) != PMU_AVDT_0) && ((avd_n) != PMU_AVDT_1) && \
                                                          ((avd_n) != PMU_AVDT_2) && ((avd_n) != PMU_AVDT_3))
/* check PMU over voltage detector threshold */
#define NOT_PMU_OVD(ovd_n)                               (((ovd_n) != PMU_OVDT_0) && ((ovd_n) != PMU_OVDT_1) && \
                                                          ((ovd_n) != PMU_OVDT_2) && ((ovd_n) != PMU_OVDT_3))
/* check PMU over voltage detector threshold */
#define NOT_PMU_UVD(uvd_n)                               (((uvd_n) != PMU_UVDT_0) && ((uvd_n) != PMU_UVDT_1) && \
                                                          ((uvd_n) != PMU_UVDT_2))
/* check PMU Deep-sleep mode Vcore core voltage select */
#define NOT_PMU_SLDO(sldo_n)                             (((sldo_n) != PMU_SLDOVS_1) && ((sldo_n) != PMU_SLDOVS_2) &&\
                                                          ((sldo_n) != PMU_SLDOVS_3))
/* check PMU VBAT battery charging resistor selection */
#define NOT_PMU_VBAT(resistor)                           (((resistor) != PMU_VCRSEL_5K) && ((resistor) != PMU_VCRSEL_1P5K))
/* check PMU power supply */
#define NOT_PMU_SMPS_LDO_SUPPLY(smpsmode)                (((smpsmode) != PMU_DIRECT_SMPS_SUPPLY) && ((smpsmode) != PMU_BYPASS))
/* check PMU sleep mode */
#define NOT_PMU_SLEEPMODE(sleepmodecmd)                  (((sleepmodecmd) != WFI_CMD) && ((sleepmodecmd) != WFE_CMD))
/* check PMU wakeup pin */
#define NOT_PMU_WAKEUP_PIN(wakeup_pin)                   (((wakeup_pin) != PMU_WAKEUP_PIN0) && ((wakeup_pin) != PMU_WAKEUP_PIN1) && \
                                                          ((wakeup_pin) != PMU_WAKEUP_PIN3) && ((wakeup_pin) != PMU_WAKEUP_PIN5))
/* check PMU flag state */
#define NOT_PMU_FLAG(flag)                               (((flag) != PMU_FLAG_WAKEUP) && ((flag) != PMU_FLAG_STANDBY) && \
                                                          ((flag) != PMU_FLAG_LVDF) && ((flag) != PMU_FLAG_UVDF) && \
                                                          ((flag) != PMU_FLAG_VUVDF0) && ((flag) != PMU_FLAG_VOVDF1) && \
                                                          ((flag) != PMU_FLAG_VUVDF1) && ((flag) != PMU_FLAG_VAVDF) && \
                                                          ((flag) != PMU_FLAG_VOVDF0)&& ((flag) != PMU_FLAG_BKPVSRF) && \
                                                          ((flag) != PMU_FLAG_MIPIHTF) && ((flag) != PMU_FLAG_TEMPLF) && \
                                                          ((flag) != PMU_FLAG_TEMPHF) && ((flag) != PMU_FLAG_ESCHTF) && \
                                                          ((flag) != PMU_FLAG_USB33RF) && ((flag) != PMU_FLAG_VBATLF) && \
                                                          ((flag) != PMU_FLAG_VBATHF) && ((flag) != PMU_FLAG_PKCAUHTF) && \
                                                          ((flag) != PMU_FLAG_PRDYN) && ((flag) != PMU_FLAG_RDYFALLF) && \
                                                          ((flag) != PMU_FLAG_RDYF))
/* check PMU reset flag state */
#define NOT_PMU_FLAG_RESET(flag_reset)                   (((flag_reset) != PMU_FLAG_WAKEUP) && ((flag_reset) != PMU_FLAG_STANDBY) && \
                                                          ((flag_reset) != PMU_FLAG_RDYFALLF))
/* check PMU wakeup pin */
#define NOT_SRAM_MODE(wakeup_pin)                        (((sram_mode) != PMU_DISABLE) && ((sram_mode) != PMU_PRECHARGE) && \
                                                          ((sram_mode) != PMU_RETENTION))
/* check output filter length */
#define NOT_PMU_FILTER_LENGTH(length)                    (((uint32_t)(length)) > 255U)
/* check PMU reset flag state */
#define NOT_PMU_THRESHOLD_VALUE(threshold_value)         (((threshold_value) != PDR_FALLING_THRESHOLD0) && ((threshold_value) != PDR_FALLING_THRESHOLD1))

