RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_pmu.h
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* reset PMU registers */
void pmu_deinit(void);
/* select low voltage detector threshold */
void pmu_lvd_select(uint32_t lvdt_n);
/* enable PMU lvd */
void pmu_lvd_enable(void);
/* disable PMU lvd */
void pmu_lvd_disable(void);
/* select analog voltage detector threshold */
void pmu_avd_select(uint32_t avdt_n);
/* enable PMU analog voltage detector */
void pmu_avd_enable(void);
/* disable PMU analog voltage detector */
void pmu_avd_disable(void);
/* select PMU Vcore over detector threshold */
void pmu_ovd_select(uint32_t ovdt_n);
/* enable PMU Vcore over voltage detector */
void pmu_ovd_enable(void);
/* disable PMU Vcore over voltage detector */
void pmu_ovd_disable(void);
/* select PMU Vcore under voltage detector threshold */
void pmu_uvd_select(uint32_t uvdt_n);
/* enable PMU Vcore under voltage detector */
void pmu_uvd_enable(void);
/* disable PMU Vcore under voltage detector */
void pmu_uvd_disable(void);
/* deep-sleep mode Vcore core voltage select */
void pmu_sldo_output_select(uint32_t sldo);

/* PMU VBAT battery charging resistor selection */
void pmu_vbat_charging_select(uint32_t resistor);
/* enable VBAT battery charging */
void pmu_vbat_charging_enable(void);
/* disable VBAT battery charging */
void pmu_vbat_charging_disable(void);
/* enable VBAT and temperature monitoring */
void pmu_vbat_temp_monitor_enable(void);
/* disable VBAT and temperature monitoring */
void pmu_vbat_temp_monitor_disable(void);

/* USB regulator*/
/* enable USB regulator */
void pmu_usb_regulator_enable(void);
/* disable USB regulator */
void pmu_usb_regulator_disable(void);
/* enable VDD33USB voltage level detector */
void pmu_usb_voltage_detector_enable(void);
/* disable VDD33USB voltage level detector */
void pmu_usb_voltage_detector_disable(void);

/* enable pkcau power*/
void pmu_pkcau_power_enable(void);
/* disable pkcau power */
void pmu_pkcau_power_disable(void);
/* enable pkcau output isolation */
void pmu_pkcau_output_isolation_enable(void);
/* disable pkcau output isolation */
void pmu_pkcau_output_isolation_disable(void);

/* enable esc power */
void pmu_esc_power_enable(void);
/* disable esc power */
void pmu_esc_power_disable(void);
/* enable esc output isolation */
void pmu_esc_output_isolation_enable(void);
/* disable esc output isolation */
void pmu_esc_output_isolation_disable(void);

/* power supply configurations */
void pmu_smps_ldo_supply_config(uint32_t smpsmode);

/* set PMU mode */
/* enter sleep mode */
void pmu_to_sleepmode(uint8_t sleepmodecmd);
/* enter deepsleep mode */
void pmu_to_deepsleepmode(uint8_t deepsleepmodecmd);
/* enter standby mode */
void pmu_to_standbymode(void);
/* enable PMU wakeup pin */
void pmu_wakeup_pin_enable(uint32_t wakeup_pin);
/* disable PMU wakeup pin */
void pmu_wakeup_pin_disable(uint32_t wakeup_pin);

/* backup related functions */
/* enable backup domain write */
void pmu_backup_write_enable(void);
/* disable backup domain write */
void pmu_backup_write_disable(void);
/* enable backup voltage stabilizer */
void pmu_backup_voltage_stabilizer_enable(void);
/* disable backup voltage stabilizer */
void pmu_backup_voltage_stabilizer_disable(void);

/* configure IRC counter before enter Deep-sleep mode */
void pmu_enter_deepsleep_wait_time_config(uint32_t wait_time);
/* configure IRC counter before exit Deep-sleep mode */
void pmu_exit_deepsleep_wait_time_config(uint32_t wait_time);

/* enable CORE PDR circuit */
void pmu_core_pdr_enable(void);
/* disable CORE PDR circuit */
void pmu_core_pdr_disable(void);
/* enable CORE POR OFF output */
void pmu_core_por_off_enable(void);
/* disable CORE POR OFF output */
void pmu_core_por_off_disable(void);
/* enable CORE POR OFF output polarity negation */
void pmu_output_polarity_negation_enable(void);
/* disable CORE POR OFF output polarity negation */
void pmu_output_polarity_negation_disable(void);

/* sram mode in deep-sleep selection */
void pmu_sram_mode_selection(uint32_t sram_mode);
/* VUVD analog output filter length config */
void pmu_vuvd_output_config(uint32_t length);
/* VOVD analog output filter length config */
void pmu_vovd_output_config(uint32_t length);

/* enable MIPI LDO */
void pmu_mipi_ldo_enable(void);
/* disable MIPI LDO */
void pmu_mipi_ldo_disable(void);
/* enable MIPI power */
void pmu_mipi_power_enable(void);
/* disable MIPI power */
void pmu_mipi_power_disable(void);
/* enable MIPI output isolation */
void pmu_mipi_output_isolation_enable(void);
/* disable MIPI output isolation */
void pmu_mipi_output_isolation_disable(void);
/* enable MIPI LDO bypass */
void pmu_mipi_ldo_bypass_enable(void);
/* disable MIPI LDO bypass */
void pmu_mipi_ldo_bypass_disable(void);
/* MIPI LDO VDD09DSI PDR threshold selection */
void pmu_vdd09dsi_pdr_threshold_selection(uint8_t threshold_value);
/* enable MIPI LDO VDD09DSI PDR function */
void pmu_vdd09dsi_pdr_enable(void);
/* enable MIPI LDO VDD09DSI PDR function */
void pmu_vdd09dsi_pdr_disable(void);

/* flag functions */
/* clear flag bit */
void pmu_flag_clear(uint32_t flag_reset);
/* get flag state */
FlagStatus pmu_flag_get(uint32_t flag);

#endif /* GD32H77X_78X_PMU_H */
